# Exercise Practice

In [10]:
#importing libraries
import pandas as pd
import numpy as np
import os

In [2]:
#importing products.csv and orders.csv
path = r'C:\Users\William Inglish\Instacart Basket Analysis'

df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data' , 'products.csv'), index_col = False)
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data' , 'orders_wrangled.csv'), index_col = False)

In [3]:
#checking stats of dataframe
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,order_day_of_the_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

## Mixed Data-types

In [4]:
# Create a dataframe

df_test = pd.DataFrame()

In [5]:
# Create a mixed type column

df_test['mix'] = ['a', 'b', 1, True]

In [6]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [7]:
#Checking for mixed datatypes

for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [9]:
#assinging df_test mix column as an object

df_test['mix'] = df_test['mix'].astype('str')

## Missing values

In [11]:
#summing all null values in each column of a dataframe, products.csv
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [12]:
#creating new dataframe for null values of 'product_name' in the products.csv
df_nan = df_prods[df_prods['product_name'].isnull() == True]

df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [13]:
df_prods.shape

(49693, 5)

In [14]:
# Getting all non-missing values into a df and outputing the new shape
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

df_prods_clean.shape

(49677, 5)

Other ways to drop all missing values:

df_prods.dropna(subset = [‘product_name’], inplace = True)

df_prods.dropna(inplace = True)

## Duplicate Values

In [17]:
#Looking for full row duplicates within dataframe
df_dups = df_prods_clean[df_prods_clean.duplicated()]

df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [18]:
#addressing duplicates by dropping them from the df and assigning the value to a new df
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

df_prods_clean_no_dups.shape

(49672, 5)

## Tidying Up and Exporting Changes

In [20]:
#Exporting the cleaned products dataframe as 'products_cleaned.csv'
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_cleaned.csv'))

# Exercise Problems

## Problem 1: Look in Exercise Practice section

## Problem 2

In [21]:
# Looking for any data that looks off or should be investigated
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,order_day_of_the_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

We can ignore this dataframe, but we want to look at the newly created dataframe, 'products_cleaned'

In [22]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

The Max value of the 'prices' column is questionable due to its high value 99999.0 and the median being 7.1

## Problem 3

In [29]:
# Checking for mixed data types in orders_wrangled.csv

for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col, 'mixed')
  else: print(col,'consistent')

Unnamed: 0 consistent
order_id consistent
user_id consistent
evaluation_set consistent
order_number consistent
order_day_of_the_week consistent
order_hour_of_day consistent
days_since_prior_order consistent

## Problem 4: No mixed-type data was found in df_ords

## Problem 5

In [30]:
# Checking for missing values in df_ords

df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
evaluation_set                 0
order_number                   0
order_day_of_the_week          0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

The only null values are in 'days_since_prior_order'. This might be due to human-error, data-corruption, or since most orders have to start a history of ordering, that means there wouldn't be any orders beforehand since it is the origin of that customers ordering.

## Problem 6

In [36]:
# Verifying pattern for Null values
df_ords[df_ords['order_number'] == 1]

,Unnamed: 0,order_id,user_id,evaluation_set,order_number,order_day_of_the_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,prior,1,2,8,NaN
11,11,2168274,2,prior,1,2,11,NaN
26,26,1374495,3,prior,1,1,14,NaN
39,39,3343014,4,prior,1,6,11,NaN
45,45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,prior,1,4,12,NaN
3420934,3420934,3189322,206206,prior,1,3,18,NaN
3421002,3421002,2166133,206207,prior,1,6,19,NaN
3421019,3421019,2227043,206208,prior,1,1,15,NaN
3421069,3421069,3154581,206209,prior,1,3,11,NaN

I will make no changes, the only thing I will do is inform the stakeholders on the order_number equalling to 1 is the first order from the customer. That means that there will be no previous order therfore explaining the null values in the dataset.

## Problem 7

In [31]:
# Getting duplicate values of orders.csv into another df
df_ords_dups = df_ords[df_ords.duplicated()]

df_ords_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, evaluation_set, order_number, order_day_of_the_week, order_hour_of_day, days_since_prior_order]
Index: []

No duplicate records found in order dataframe

## Problem 8

I will make no changes, since there aren't any to be made

## Problem 9

In [38]:
# Exporting changes, which the only change was to orders.csv
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))